** another get and set function

#+begin_src dart :results output
class Circle {
  double _radius = 0;

  Circle(double radius) {
    this.radius = radius;
  }

  set radius(double value) {
    if (value >= 0) {
      _radius = value;
    }
  }

  double get radius => _radius;

  get area => radius * radius * 3.14;
}


void main() {
  var circle = Circle(10);
  circle.radius = 100;
  print('The area is ${circle.area}');
}
#+end_src

#+RESULTS:
: The area is 31400.0


** Cascades

#+begin_src dart :results output
print("String".length.toString()); // 6
print("String"..length.toString()); // "String"
#+end_src

#+RESULTS:
: 6
: String

** type

#+begin_src dart :results output
var type_string = <String> ['a', 'b', 'c'];
print(type_string);
print("hello" + "world");
print("hello" * 2);
#+end_src

#+RESULTS:
: [a, b, c]
: helloworld
: hellohello


** Set, StringBuffer data type

#+begin_src dart :results output
Set mySet = {1, 2, 3};
print(mySet.lookup(2));

StringBuffer stringBuffer = StringBuffer('test string');
stringBuffer.write(' append string');
print(stringBuffer);
#+end_src

#+RESULTS:
: 2
: test string append string

** async, await

#+begin_src dart :results output
main() {
    getData();
    print("continue...");
}

getData() async {
    var data = await "data string";
    print(data);
}
#+end_src

#+RESULTS:
: continue...
: data string



** number example
#+begin_src dart :results output
void main() {
  var i = 2;
  print(i.runtimeType);
  String value1 = "123";
  int parseValue = int.parse(value1);
  print(parseValue);
  print(parseValue.runtimeType);

  String value2 = "2.2";
  print(value2.runtimeType);
  double parseValue2 = double.parse(value2);
  print(parseValue2.runtimeType);
  print(parseValue2);
}
#+end_src

#+RESULTS:
: int
: 123
: int
: String
: double
: 2.2
